Repository: buyakovK/RepoDB
Catalog: RepoDB/RepoDB/*.lproj/Localizable.strings
Languages: ru

# error_code_1
source: Undefined Error
ru: Неизвестная ошибка

# error_code_2
source: Internal Error
ru: Внутренняя ошибка

# error_code_3
source: Permission Denied
ru: Отказано в доступе

# error_code_4
source: Operation aborted
ru: Операция отклонена

# error_code_5
source: Database file cannot be written/read due to the simultaneous activity of any other database connection
ru: Файл базы данных не может быть записан/прочитан из-за одновременной активности любого другого соединения с базой данных

# error_code_6
source: The write operation could not be continued due to a conflict in the same database connection or a conflict with another database connection using the shared cache
ru: Операция записи не может быть продолжена из-за конфликта в том же соединении с базой данных или конфликта с другим соединением с базой данных с использованием общего кэша

# error_code_7
source: It was not possible to allocate all the memory needed to complete the operation
ru: Не было возможности выделить всю память, необходимую для завершения операции

# error_code_8
source: Attempt to modify some data for which the current database connection does not have write permission
ru: Попытайтесь изменить некоторые данные, для которых текущее соединение с базой данных не имеет разрешения на запись

# error_code_9
source: Operation aborted
ru: Операция отклонена

# error_code_10
source: The operation could not be completed because the operating system reported an I/O error
ru: Операция не может быть завершена, поскольку операционная система сообщила об ошибке ввода-вывода

# error_code_11
source: Database file was corrupted
ru: Файл базы данных был поврежден

# error_code_12
source: Database object not found
ru: Объект базы данных не найден

# error_code_13
source: Recording cannot be completed because the disc is full
ru: Запись не может быть завершена, потому что диск заполнен

# error_code_14
source: Could not open file
ru: Невозможно открыть файл

# error_code_15
source: Problem with SQLite File Lock Protocol
ru: Проблема с протоколом блокировки файлов SQLite

# error_code_17
source: Database schema has changed
ru: Схема базы данных изменилась

# error_code_18
source: The string or blob was too large
ru: Строка или двоичный код слишком большие

# error_code_19
source: Attempted to process SQL statement violating SQL constraint
ru: Попытка обработать оператор SQL, нарушающий ограничение SQL

# error_code_20
source: Data Type Mismatch
ru: Несоответствие типов данных

# error_code_21
source: An application uses some SQLite interface in a way that is not defined or not supported
ru: Приложение использует интерфейс SQLite способом, который не определен или не поддерживается

# error_code_22
source: No support for large files
ru: Нет поддержки больших файлов

# error_code_23
source: Authorizer callback indicates prepared SQL statement is not authorized
ru: Обратный вызов Authorizer указывает, что подготовленный оператор SQL не авторизован

# error_code_24
source: Currently not using SQLite
ru: В настоящее время не используется SQLite

# error_code_25
source: The argument of the parameter number is out of range
ru: Аргумент номера параметра находится вне диапазона

# error_code_26
source: The file you are opening is not a SQLite database file
ru: Файл, который вы открываете, не является файлом базы данных SQLite

# error_code_27
source: Unusual and possibly rash operation
ru: Необычная и возможно необдуманная операция

# error_code_28
source: Unusual and possibly rash operation
ru: Необычная и возможно необдуманная операция

# error_code_100
source: Another output line is available
ru: Доступна еще одна строка вывода
